teaching/misc/L24 Handout/EDTL24Handout.org
#+TITLE: The COMPAS Debate
#+AUTHOR:    EDT
#+EMAIL:     david.grant@ufl.edu
#+OPTIONS:   toc:nil title:nil
#+DATE:      11/18/2021
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LaTeX_CLASS: dmghandout

* COMPAS

Recidivism prediction instrument developed by Northpointe, inc.
- Estimates risk of committing a crime within 2 years
- Uses probability of being charged with a new crime as a proxy

* TP, TN, FP, FN

/True positive (TP):/ labeled high risk, reoffends \\
/True negative (TN):/ labeled low risk, doesn't reoffend \\
/False positive (FP):/ labeled high risk, doesn't reoffend \\
/False negative (FN):/ labeled low risk, reoffends \\

* False positive rate

The probability that a randomly selected defendant who does not reoffend will be labeled “high risk”

$$\text{FPR} = \frac{\text{FP}}{\text{FP+TN}} = \frac{\text{labeled HR, no recidivism}}{\text{no recidivism}}$$

* Equal False Positive Rates

The false positive rate for black defendants is similar to the false positive rate for white defendants

* Equal Calibration

Defendants who receive the same risk score reoffend at similar rates, regardless of race

* Base Rate

The percentage of defendants from the group that reoffend

$$\text{BR} = \frac{\text{TP+FN}}{\text{TP+TN+FP+FN}} = \frac{\text{defendants that reoffend}}{\text{all defendants}}$$
